#include "global.h"
#include "abilities.h"
#include "battle.h"
#include "moves.h"
//#include "item.h"
#include "items.h"
#include "hold_effects.h"
#include "species.h"
#include "pokemon.h"
//#include "data2.h"
#include "rng.h"
#include "text.h"
#include "battle_move_effects.h"
#include "string_util.h"
//#include "flags.h"

struct ChoicedMoveSomething
{
    /*0x00*/ u8 turnEffectsTracker;
    /*0x01*/ u8 turnEffectsBank;
    u8 filler2[1];
    /*0x03*/ u8 turncountersTracker;
    /*0x04*/ u8 unk4[8];
    /*0x0C*/ u8 fillerC[0x4D-0xC];

            u8 unk4D;
            u8 unk4E;
    //        u8 filler4F[0xC8-0x4F];
            u8 filler4F[0x5C-0x4F];

            u8 unk5C[4];
            u8 filler60[0xC8-0x60];

    /*0xC8*/ u16 unkC8[4];
    u8 fillerD0[0xA];
    /*0xDA*/ u8 unkDA;
    /*0xDB*/ u8 turnSideTracker;
    u8 fillerDC[0xDF-0xDC];
    u8 unkDF;
    u8 fillerE0[0x1A0-0xE0];
    /*0x1A0*/ u8 unk1A0;
    /*0x1A1*/ u8 unk1A1;
    u8 filler1A2;
    /*0x1A3*/ u8 atkCancellerTracker;
};

struct UnknownStruct1
{
    u8 filler0[4];
    s32 bideDmg;
    u8 filler8[0x10-8];

    /*0x10*/ u8 animArg1;
    /*0x11*/ u8 animArg2;
    u8 filler12[5];
    /*0x17*/ u8 scriptingActive;
};

extern u8* gBattlescriptCurrInstr;
extern u8 gActiveBank;
extern u8 gBattleBufferB[4][0x200];
extern struct ChoicedMoveSomething *gUnknown_0202449C;  // choiced move something?
extern struct UnknownStruct1 gUnknown_02024474;
extern u16 gCurrentMove;
extern struct BattlePokemon gBattleMons[4];
extern u32 gBattleTypeFlags;
extern u8 gStringBank;
extern const struct BattleMove gBattleMoves[];
extern u16 gLastUsedMove[];
extern u16 gLastUsedItem;
extern u8 gNoOfAllBanks;
extern u32 gStatuses3[];
extern u8 gBankAttacker;
extern u8 gBankTarget;
extern u8 gAbsentBankFlags;
extern u16 gBattleWeather;
extern u8 gTurnOrder[];
extern u8 gBattleTextBuff1[];
extern u16 gSideAffecting[];
extern u8 gBattleCommunication[];
extern void (*gBattleMainFunc)(void);
extern s32 gBattleMoveDamage;

extern const u8 *gUnknown_02024220[];
extern const u8 *gUnknown_02024230[];

// scripts
extern const u8 gUnknown_082DAE2A[];
extern const u8 gUnknown_082DAE1F[];
