#include "global.h"
#include "pokemon.h"
#include "battle.h"
#include "species.h"
#include "abilities.h"

#define AIScriptRead32(ptr) ((ptr)[0] | (ptr)[1] << 8 | (ptr)[2] << 16 | (ptr)[3] << 24)
#define AIScriptRead16(ptr) ((ptr)[0] | (ptr)[1] << 8)
#define AIScriptRead8(ptr) ((ptr)[0])
#define AIScriptReadPtr(ptr) (u8*) AIScriptRead32(ptr)

#define AI_THINKING_STRUCT ((struct AI_ThinkingStruct *)(gBattleStruct->ai))
#define UNK_2016A00_STRUCT ((struct UnknownStruct2 *)(gBattleStruct->unk18))
#define UNK_2016C00_STRUCT ((struct UnknownStruct4 *)(gBattleStruct->unk1C))
#define UNK_BATTLE_STRUCT ((struct BattleStruct *)(gBattleStruct))

#define AI_ACTION_UNK1          0x0001
#define AI_ACTION_UNK2          0x0002
#define AI_ACTION_UNK3          0x0004
#define AI_ACTION_UNK4          0x0008
#define AI_ACTION_UNK5          0x0010
#define AI_ACTION_UNK6          0x0020
#define AI_ACTION_UNK7          0x0040
#define AI_ACTION_UNK8          0x0080

enum
{
    TARGET,
    USER
};

// AI states
enum
{
    AIState_SettingUp,
    AIState_Processing,
    AIState_FinishedProcessing,
    AIState_DoNotProcess
};

//Copied from pokeruby -- hopefully the same
struct Trainer
{
    /*0x00*/ u8 partyFlags;
    /*0x01*/ u8 trainerClass;
    /*0x02*/ u8 encounterMusic:7;
    /*0x02*/ u8 gender:1;
    /*0x03*/ u8 trainerPic;
    /*0x04*/ u8 trainerName[12];
    /*0x10*/ u16 items[4];
    /*0x18*/ bool8 doubleBattle;
    /*0x1C*/ u32 aiFlags;
    /*0x20*/ u8 partySize;
    /*0x24*/ void *party;
};

//size should be 0x1C
struct AI_ThinkingStruct
{
    u8 aiState;
    u8 movesetIndex;
    u16 moveConsidered;
    s8 score[4];
    u32 funcResult;
    u32 aiFlags;
    u8 aiAction;
    u8 aiLogicId;
    u8 filler12[6];
    u8 unk18[4];
};

//size should be 0x54
struct UnknownStruct2
{
    u16 unk0[2][8];
    u8 unk20[2];
    u8 filler20[0x1E];
    u8 unk40[4];
    u8 unk44[4];
    u16 unk48[4];
    u8 unk50;
};

struct UnknownStruct4
{
    u8 *ptr[8];
    u8 unk20;
};

struct SimpleUnknownStruct
{
    u32 unkArray[4]; // unknown size
};

/*
struct UnknownStruct5
{
    u8 filler0[0x3];
    u16 unk4;
    u16 unk6;
    u8 unk8;
    u8 unk9;
    u8 fillerA[0x9];
    u8 taunt:4;
    u8 unkC:4;
    u8 fillerD[0x2];
    u8 unk16;
    u8 filler17[0x4];
};

extern struct UnknownStruct5 gDisableStructs[];
*/

/*
gAIScriptPtr is a pointer to the next battle AI cmd command to read.
when a command finishes processing, gAIScriptPtr is incremented by
