#include "global.h"
#include "main.h"
#include "battle.h"
#include "battle_anim.h"
#include "frontier_util.h"
#include "battle_message.h"
#include "battle_tent.h"
#include "battle_factory.h"
#include "bg.h"
#include "bw_summary_screen.h"
#include "contest.h"
#include "contest_effect.h"
#include "data.h"
#include "daycare.h"
#include "decompress.h"
#include "dynamic_placeholder_text_util.h"
#include "event_data.h"
#include "gpu_regs.h"
#include "graphics.h"
#include "international_string_util.h"
#include "item.h"
#include "link.h"
#include "m4a.h"
#include "malloc.h"
#include "menu.h"
#include "menu_helpers.h"
#include "mon_markings.h"
#include "party_menu.h"
#include "palette.h"
#include "pokeball.h"
#include "pokemon.h"
#include "pokemon_sprite_visualizer.h"
#include "pokemon_storage_system.h"
#include "pokemon_summary_screen.h"
#include "region_map.h"
#include "scanline_effect.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "strings.h"
#include "task.h"
#include "text.h"
#include "tv.h"
#include "window.h"
#include "constants/battle_move_effects.h"
#include "constants/hold_effects.h"
#include "constants/items.h"
#include "constants/moves.h"
#include "constants/party_menu.h"
#include "constants/region_map_sections.h"
#include "constants/rgb.h"
#include "constants/songs.h"

#if BW_SUMMARY_SCREEN == TRUE
enum BWPSSPage
{
    PSS_PAGE_INFO,
    PSS_PAGE_SKILLS,
    PSS_PAGE_BATTLE_MOVES,
    PSS_PAGE_CONTEST_MOVES,
    PSS_PAGE_COUNT,
    PSS_BUFFER_BATTLE_EFFECTS = PSS_PAGE_COUNT,
    PSS_BUFFER_CONTEST_EFFECTS,
    PSS_BUFFER_COUNT
};

enum BWSkillsPageState
{
    SKILL_STATE_STATS,
    SKILL_STATE_IVS,
    SKILL_STATE_EVS,
};

// Screen titles (upper left)
#define PSS_LABEL_WINDOW_POKEMON_INFO_TITLE 0
#define PSS_LABEL_WINDOW_POKEMON_SKILLS_TITLE 1
#define PSS_LABEL_WINDOW_BATTLE_MOVES_TITLE 2
#define PSS_LABEL_WINDOW_CONTEST_MOVES_TITLE 3

// Button control text (upper right)
#define PSS_LABEL_WINDOW_PROMPT_CANCEL 4
#define PSS_LABEL_WINDOW_PROMPT_INFO 5
#define PSS_LABEL_WINDOW_PROMPT_SWITCH 6

// Info screen
#define PSS_LABEL_WINDOW_POKEMON_INFO_TYPE 7

// Skills screen
#define PSS_LABEL_WINDOW_POKEMON_SKILLS_EXP 8 // EXP Next Level

// Moves screen
#define PSS_LABEL_WINDOW_MOVES_POWER_ACC 9 // Also contains the power and accuracy values

// Above/below the pokemon's portrait (right)
#define PSS_LABEL_WINDOW_PORTRAIT_NICKNAME_GENDER_LEVEL 10

// additional button prompts for IVs and EVs
#define PSS_LABEL_WINDOW_PROMPT_IVS 11
#define PSS_LABEL_WINDOW_PROMPT_EVS 12
#define PSS_LABEL_WINDOW_PROMPT_STATS 13

#define PSS_LABEL_WINDOW_END 14

// Dynamic fields for the Pokémon Info page
#define PSS_DATA_WINDOW_INFO_OT_OTID_ITEM 0
#define PSS_DATA_WINDOW_INFO_MEMO 1
#define PSS_DATA_WINDOW_INFO_DEX_NUMBER_NAME 2

// Dynamic fields for the Pokémon Skills page
#define PSS_DATA_WINDOW_SKILLS_RIBBON_COUNT 0 //ravetodo handle ribbons
#define PSS_DATA_WINDOW_SKILLS_STATS_HP 1
#define PSS_DATA_WINDOW_SKILLS_STATS_NON_HP 2 //  Attack, Defense, Sp. Attack, Sp. Defense, Speed
#define PSS_DATA_WINDOW_EXP 3 // Exp
#define PSS_DATA_WINDOW_EXP_NEXT_LEVEL 4 // Exp next level
#define PSS_DATA_WINDOW_SKILLS_ABILITY 5

// Dynamic fields for the Battle Moves and Contest Moves pages.
#define PSS_DATA_WINDOW_MOVE_NAMES_PP 0
#define PSS_DATA_WINDOW_MOVE_DESCRIPTION 1

#define MOVE_SELECTOR_SPRITES_COUNT 15
#define TYPE_ICON_SPRITE_COUNT (MAX_MON_MOVES + 1)
// for the spriteIds field in PokemonSummaryScreenData
enum BWSummarySprites
{
    SPRITE_ARR_ID_MON,
    SPRITE_ARR_ID_BALL,
    SPRITE_ARR_ID_STATUS,
    SPRITE_ARR_ID_SHINY,
    SPRITE_ARR_ID_POKERUS_CURED,
    SPRITE_ARR_ID_FRIENDSHIP,
    SPRITE_ARR_ID_CATEGORY,
    SPRITE_ARR_ID_HP_GRADE,
    SPRITE_ARR_ID_ATK_GRADE,
    SPRITE_ARR_ID_DEF_GRADE,
    SPRITE_ARR_ID_SPA_GRADE,
    SPRITE_ARR_ID_SPD_GRADE,
    SPRITE_ARR_ID_SPE_GRADE,
    SPRITE_ARR_ID_TERA_TYPE,
    SPRITE_ARR_ID_TYPE, // 2 for mon types, 5 for move types(4 moves and 1 to learn), used interchangeably, because mon types and move types aren't shown on the same screen
    SPRITE_ARR_ID_MOVE_SELECTOR1 = SPRITE_ARR_ID_TYPE + TYPE_ICON_SPRITE_COUNT, // 10 sprites that make up the selector
    SPRITE_ARR_ID_MOVE_SELECTOR2 = SPRITE_ARR_ID_MOVE_SELECTOR1 + MOVE_SELECTOR_SPRITES_COUNT,
    SPRITE_ARR_ID_COUNT = SPRITE_ARR_ID_MOVE_SELECTOR2 + MOVE_SELECTOR_SPRITES_COUNT
};

static EWRAM_DATA struct PokemonSummaryScreenData
{
    /*0x00*/ union {
        struct Pokemon *mons;
        struct BoxPokemon *boxMons;
    } monList;
    /*0x04*/ MainCallback callback;
    /*0x08*/ struct Sprite *markingsSprite;
    /*0x0C*/ struct Pokemon currentMon;
    /*0x70*/ struct PokeSummary
    {
        u16 species; // 0x0
        u16 species2; // 0x2
        u8 isEgg:1; // 0x4
        u8 isShiny:1;
        u8 padding:6;
        u8 level; // 0x5
        u8 ribbonCount; // 0x6
        u8 ailment; // 0x7
        u8 abilityNum; // 0x8
        u8 metLocation; // 0x9
        u8 metLevel; // 0xA
        u8 metGame; // 0xB
        u32 pid; // 0xC
        u32 exp; // 0x10
        u16 moves[MAX_MON_MOVES]; // 0x14
        u8 pp[MAX_MON_MOVES]; // 0x1C
        u16 currentHP; // 0x20
        u16 maxHP; // 0x22
        u16 atk; // 0x24
        u16 def; // 0x26
        u16 spatk; // 0x28
        u16 spdef; // 0x2A
        u16 speed; // 0x2C
        u16 item; // 0x2E
        u16 friendship; // 0x30
        u8 OTGender; // 0x32
        u8 nature; // 0x33
        u8 ppBonuses; // 0x34
        u8 sanity; // 0x35
        u8 OTName[17]; // 0x36
        u32 OTID; // 0x48  
        u8 teraType;
        u8 mintNature;
        u8 ivHp;
        u8 ivAtk;
        u8 ivDef;
        u8 ivSpatk;
        u8 ivSpdef;
        u8 ivSpeed;
        u8 evHp;
        u8 evAtk;
        u8 evDef;
        u8 evSpatk;
        u8 evSpdef;
        u8 evSpeed; // 0x56
    } summary;
    u16 bgTilemapBuffers[PSS_BUFFER_COUNT][2][0x400];
    u8 mode;
    bool8 isBoxMon;
    u8 curMonIndex;
    u8 maxMonIndex;
    u8 currPageIndex;
    u8 minPageIndex;
    u8 maxPageIndex;
    bool8 lockMonFlag; // This is used to prevent the player from changing Pokémon in the move deleter select, etc, but it is not needed because the input is handled differently there
    u16 newMove;
    u8 firstMoveIndex;
    u8 secondMoveIndex;
    bool8 lockMovesFlag; // This is used to prevent the player from changing position of moves in a battle or when trading.
    u8 bgDisplayOrder; // Determines the order page backgrounds are loaded while scrolling between them
    u8 filler40CA;
    u8 windowIds[8];
    u8 spriteIds[SPRITE_ARR_ID_COUNT];
    bool8 handleDeoxys;
    s16 switchCounter; // Used for various switch statement cases that decompress/load graphics or Pokémon data
    u8 unk_filler4[6];
} *sMonSummaryScreen = NULL;

