#include "global.h"
#include "alloc.h"
#include "palette.h"
#include "window.h"
#include "bg.h"
#include "gpu_regs.h"
#include "random.h"
#include "link.h"
#include "link_rfu.h"
#include "task.h"
#include "main.h"
#include "constants/songs.h"
#include "sound.h"
#include "m4a.h"
#include "pokemon_jump.h"

struct DodrioBerryPickingSubstruct_0160
{
    /*0x0000 : 0x0160*/ u8 filler_000[12];
    /*0x000C : 0x016C*/ u8 unk_00C;
    /*0x000D : 0x016D*/ u8 filler_00D[0x3000 - 0xd];
    /*0x3000 : 0x3160*/ u32 unk_3000;
    /*0x3004 : 0x3164*/ u8 filler_3004[16];
    /*0x3014 : 0x3174*/ u8 unk_3014;
    /*0x3015 : 0x3175*/ u8 filler_3015[0x318C - 0x3175];
}; // size = 0x302C

struct DodrioBerryPickingStruct_2022CF4
{
    u8 filler_00[0x40];
}; // size = 0x40

struct DodrioBerryPickingSubstruct_31A0_14
{
    u8 unk_0[11];
    u8 unk_B[11];
};

struct DodrioBerryPickingSubstruct_31A0
{
    u8 unk_00[0x10];
    u32 unk_10;
    struct DodrioBerryPickingSubstruct_31A0_14 unk_14;
    u8 unk_2C;
    u8 filler_2D[3];
    u8 unk_30;
    u8 filler_31[3];
    u8 unk_34;
    u8 filler_35[7];
}; // size = 0x3C

struct DodrioBerryPickingSubstruct_318C
{
    bool8 isShiny;
};

struct DodrioBerryPickingStruct
{
    /*0x0000*/ void (*savedCallback)(void);
    /*0x0004*/ u8 unk_0004;
    /*0x0005*/ u8 filler_0005[3];
    /*0x0008*/ u8 unk_0008;
    /*0x0009*/ u8 filler_0009[3];
    /*0x000C*/ u8 unk_000C;
    /*0x000D*/ u8 filler_000D[3];
    /*0x0010*/ u8 unk_0010;
    /*0x0011*/ u8 filler_0011[3];
    /*0x0014*/ u8 unk_0014;
    /*0x0015*/ u8 filler_0015[3];
    /*0x0018*/ u8 unk_0018;
    /*0x0019*/ u8 filler_0019[3];
    /*0x001C*/ u8 unk_001C;
    /*0x001D*/ u8 filler_001D[3];
    /*0x0020*/ u8 unk_0020;
    /*0x0021*/ u8 filler_0021[3];
    /*0x0024*/ u8 unk_0024;
    /*0x0025*/ u8 filler_0025[3];
    /*0x0028*/ u8 multiplayerId;
    /*0x0029*/ u8 filler_0029[7];
    /*0x0030*/ u8 unk_0030;
    /*0x0031*/ u8 filler_0031[3];
    /*0x0034*/ u8 unk_0034[5];
    /*0x0039*/ u8 filler_0039[3];
    /*0x003C*/ u8 unk_003C;
    /*0x003D*/ u8 filler_003D[3];
    /*0x0040*/ u8 unk_0040;
    /*0x0041*/ u8 filler_0041[3];
    /*0x0044*/ u8 unk_0044;
    /*0x0045*/ u8 filler_0045[3];
    /*0x0048*/ u8 unk_0048;
    // align 1
    /*0x004A*/ u16 unk_004A[5][6];
    /*0x0086*/ u16 unk_0086[5];
    /*0x0090*/ u8 unk_0090[5];
    /*0x0095*/ u8 filler_0095[3];
    /*0x0098*/ u8 unk_0098[4];
    /*0x009C*/ u8 unk_009C[12];
    /*0x00A8*/ u8 unk_00A8[5];
    /*0x00AD*/ u8 filler_00AD[3];
    /*0x00B0*/ u8 unk_00B0[5];
    /*0x00B5*/ u8 filler_00B5[3];
    /*0x00B8*/ u8 unk_00B8[5];
    /*0x00BD*/ u8 filler_00BD[7];
    /*0x00C4*/ u8 unk_00C4[11];
    /*0x00CF*/ u8 filler_00CF[1];
    /*0x00D0*/ u8 unk_00D0[11];
    /*0x00DB*/ u8 filler_00DB[1];
    /*0x00DC*/ u8 unk_00DC[11];
    /*0x00E7*/ u8 filler_0xE7[1];
    /*0x00E8*/ u8 unk_00E8[5];
    /*0x00ED*/ u8 filler_00ED[7];
    /*0x00F4*/ u8 unk_00F4[11][2];
    /*0x010A*/ u8 filler_010A[2];
    /*0x010C*/ u8 unk_010C[5];
    /*0x0111*/ u8 filler_0111[3];
    /*0x0114*/ u16 unk_0114;
    // align 2
    /*0x0118*/ u32 unk_0118;
    /*0x011C*/ u32 unk_011C;
    /*0x0120*/ u32 unk_0120;
    /*0x0124*/ u8 unk_0124;
    /*0x0125*/ u8 filler_0125[3];
    /*0x0128*/ u8 unk_0128;
    // align 2
    /*0x012C*/ u32 unk_012C;
    /*0x0130*/ u32 unk_0130[5];
    /*0x0144*/ u8 unk_0144;
    /*0x0145*/ u8 filler_0145[3];
    /*0x0148*/ u8 unk_0148[11];
    /*0x0153*/ u8 filler_0153[1];
    /*0x0154*/ u8 unk_0154;
    /*0x0155*/ u8 filler_0155[11];
    /*0x0160*/ struct DodrioBerryPickingSubstruct_0160 unk_0160;
    /*0x318C*/ struct DodrioBerryPickingSubstruct_318C unk_318C[5];
    /*0x31A0*/ struct DodrioBerryPickingSubstruct_31A0 unk_31A0[5];
    /*0x32CC*/ struct DodrioBerryPickingSubstruct_31A0 unk_32CC;
    /*0x3308*/ u8 unk_3308[0x3330 - 0x3308];
}; // size = 0x3330

EWRAM_DATA struct DodrioBerryPickingStruct * gUnknown_02022C98 = NULL;
EWRAM_DATA u16 * gUnknown_02022C9C[5] = {NULL};
EWRAM_DATA u16 * gUnknown_02022CB0[2] = {NULL};
EWRAM_DATA u16 * gUnknown_02022CB8[11] = {NULL};
EWRAM_DATA u16 * gUnknown_02022CE4[4] = {NULL};
EWRAM_DATA struct DodrioBerryPickingStruct_2022CF4 * gUnknown_02022CF4 = NULL;
EWRAM_DATA struct DodrioBerryPickingSubstruct_0160 * gUnknown_02022CF8 = NULL;

IWRAM_DATA bool32 gUnknown_03000DB0;

void sub_8024A1C(void);
void sub_8024A30(struct DodrioBerryPickingStruct *);
void sub_8024BC8(u8 taskId);
void sub_8024DBC(void);
void sub_8024E00(void);
void sub_8024E38(void);
void sub_8024F10(void);
void sub_8024F38(void);
void sub_8024FFC(void);
void sub_80250D4(void);
void sub_8025158(void);
void sub_8025198(void);
void sub_8025230(void);
void sub_8025324(void);
void sub_8025470(void);
void sub_8025644(void);
void sub_80256AC(void);
void sub_8025758(void);
