#include "global.h"
#include "battle.h"
#include "bg.h"
#include "decompress.h"
#include "item.h"
#include "constants/items.h"
#include "link.h"
#include "m4a.h"
#include "main.h"
#include "malloc.h"
#include "constants/moves.h"
#include "palette.h"
#include "pokemon.h"
#include "constants/songs.h"
#include "sound.h"
#include "constants/species.h"
#include "sprite.h"
#include "unk_text_util.h"
#include "string_util.h"
#include "task.h"
#include "text.h"
#include "window.h"
#include "event_data.h"
#include "gpu_regs.h"
#include "menu.h"
#include "international_string_util.h"
#include "scanline_effect.h"
#include "menu_helpers.h"

struct ContestMove
{
    u8 effect;
    u8 type;
    u8 comboID;
    u8 combo[4];
};

struct ContestEffect
{
    u8 type;
    u8 appeal;
    u8 jam;
};

extern struct UnkSummaryStruct* gUnknown_0203CF1C;
extern struct BgTemplate gUnknown_0861CBB4;
extern u8 gUnknown_0203CF20;
extern struct MusicPlayerInfo gMPlayInfo_BGM;
extern s8 gUnknown_0861CC1C[];
extern u8 gUnknown_0203CF21;
extern struct UnkStruct_61CC04 gUnknown_0861CC04;
extern struct UnkStruct_61CC04 gUnknown_0861CC10;
extern struct UnkStruct_61CC04 gUnknown_0861CBEC;
extern struct UnkStruct_61CC04 gUnknown_0861CBF8;
extern u16 gSummaryScreenWindow_Tilemap[];
extern struct ContestMove gContestMoves[];
extern struct ContestEffect gContestEffects[];
extern struct WindowTemplate gUnknown_0861CC24;
extern u8 gUnknown_0861CD2C[][3];
extern const u8 gSpeciesNames[][POKEMON_NAME_LENGTH + 1];
extern u8 gText_MaleSymbol[];
extern u8 gText_FemaleSymbol[];
extern u8 gUnknown_0861CDD3[];
extern void (*const gUnknown_0861CE54[])();
extern void (*const gUnknown_0861CE64[])(u8 taskId);
extern struct WindowTemplate gUnknown_0861CCCC;
extern u8 gUnknown_0861CE74[];
extern u8 gUnknown_0861CE7B[];
extern struct WindowTemplate gUnknown_0861CCEC;
extern struct WindowTemplate gUnknown_0861CD14;

void sub_81C488C(u8 a);
extern u8 sub_81221EC();
extern u8 sub_81221AC();
extern u8 gUnknown_08D9862C;
extern u8 gUnknown_08D98CC8;
extern u8 gUnknown_08D987FC;
extern u8 gUnknown_08D9898C;
extern u8 gUnknown_08D98B28;
extern u8 gUnknown_08D9853C;
extern u8 gUnknown_08D85620;
extern struct CompressedSpriteSheet gUnknown_0861CFBC;
extern struct CompressedSpriteSheet gUnknown_0861D074;
extern struct CompressedSpriteSheet gUnknown_0861D0F8;
extern struct CompressedSpritePalette gUnknown_0861D100;
extern struct CompressedSpritePalette gUnknown_0861D07C;
extern u8 gMoveTypes_Pal;
extern u8 gUnknown_08D97D0C;
extern void sub_81C1E20(u8 taskId);
extern u8 *GetMonNickname(struct Pokemon *mon, u8 *dest);
extern u16 SpeciesToPokedexNum(u16 species);
extern u8 gText_UnkCtrlF908Clear01[];
extern u8 gText_LevelSymbol[];
extern u8 gText_PkmnInfo[];
extern u8 gText_PkmnSkills[];
extern u8 gText_BattleMoves[];
extern u8 gText_ContestMoves[];
extern u8 gText_Cancel2[];
extern u8 gText_Info[];
extern u8 gText_Switch[];
extern u8 gText_RentalPkmn[];
extern u8 gText_TypeSlash[];
extern u8 gText_HP4[];
extern u8 gText_Attack3[];
extern u8 gText_Defense3[];
extern u8 gText_SpAtk4[];
extern u8 gText_SpDef4[];
extern u8 gText_Speed2[];
extern u8 gText_ExpPoints[];
extern u8 gText_NextLv[];
extern u8 gText_Status[];
extern u8 gText_Power[];
extern u8 gText_Accuracy2[];
extern u8 gText_Appeal[];
extern u8 gText_Jam[];
extern u8 gText_OTSlash[];
extern u8 gText_UnkCtrlF907F908[];
extern u8 gAbilityNames[][13];
extern u8 *gAbilityDescriptionPointers[];
extern u8 gText_XNature[];
extern u8 gText_XNatureHatchedAtYZ[];
extern u8 gText_XNatureHatchedSomewhereAt[];
extern u8 gText_XNatureMetAtYZ[];
extern u8 gText_XNatureMetSomewhereAt[];
extern u8 gText_XNatureFatefulEncounter[];
extern u8 gText_XNatureProbablyMetAt[];
extern u8 gText_XNatureObtainedInTrade[];
extern u8 *gNatureNamePointers[];
extern u8 gText_EmptyString5[];
extern u32 gBattleTypeFlags;
extern u8 gText_FiveMarks[];
extern u8 gText_EggWillTakeALongTime[];
extern u8 gText_EggAboutToHatch[];
extern u8 gText_EggWillHatchSoon[];
extern u8 gText_EggWillTakeSomeTime[];
extern u8 gText_PeculiarEggNicePlace[];
extern u8 gText_PeculiarEggTrade[];
extern u8 gText_EggFromTraveler[];
extern u8 gText_EggFromHotSprings[];
extern u8 gText_OddEggFoundByCouple[];
extern u8 gText_None[];
extern u8 gText_RibbonsVar1[];
extern u8 gUnknown_0861CE82[];
extern u8 gUnknown_0861CE8E[];
extern u8 gText_OneDash[];
extern u8 gText_TwoDashes[];
extern u8 gText_ThreeDashes[];
extern u8 gUnknown_0861CE97[];
extern struct BattleMove gBattleMoves[];

extern void sub_8199C30(u8 a, u8 b, u8 c, u8 d, u8 e, u8 f);
extern bool8 sub_81A6BF4();
extern bool8 sub_81B9E94();
extern void UnkTextUtil_Reset();
extern void sub_8124610(u8 *a, u8 b);
extern int GetPlayerIDAsU32();
extern u8 GetCurrentPpToMaxPpState(u8 a, u8 b);

void sub_81BFAE4(void);
void sub_81BFE24();
u8 sub_81BFEB0();
void sub_81C2554();
void sub_81C1BA0();
void sub_81C0098(struct Pokemon* a);
bool8 sub_81C00F0(struct Pokemon* a);
void sub_81C25E8();
void sub_81C286C();
void sub_81C2D9C(u8 a);
void sub_81C0348();
void sub_81C2AFC(u8 a);
void sub_81C4190();
void sub_81C42C8();
u8 sub_81C45F4(void* a, u16* b);
void sub_81C4984();
void sub_81C4A08();
void sub_81C4A88();
void sub_81C4280();
void sub_81C0510(u8 taskId);
void sub_81C171C(u8 taskId);
void ResetAllBgsCoordinates();
u8 sub_81B205C(struct Pokemon* a);
void sub_81C1DA4(u16 a, s16 b);
void sub_81C1EFC(u16 a, s16 b, u16 c);
void sub_81C240C(u16 a);
void sub_81C2194(u16 *a, u16 b, u8 c);
void sub_81C2074(u16 a, s16 b);
void sub_81C2524();
void sub_81C2228(struct Pokemon* mon);
void sub_81C0484(u8 taskId);
void sub_81C4898();
void sub_806F47C(u8 a);
u8 GetLRKeysState();
void sub_81C0604(u8 taskId, s8 a);
void sub_81C0A8C(u8 taskId, s8 a);
void sub_81C48F0();
void sub_81C0E48(u8 taskId);
void sub_81C0704(u8 taskId);
s8 sub_81C09B4(s8 a);
s8 sub_81C08F8(s8 a);
void sub_81C4204(u8 a, u8 b);
void sub_81C20F0(u8 taskId);
bool8 sub_81C0A50(struct Pokemon* mon);
void sub_81C49E0();
void sub_81C0E24();
void sub_81C2C38(u8 a);
void sub_81C0B8C(u8 taskId);
void sub_81C0CC4(u8 taskId);
void sub_81C2DE4(u8 a);
void sub_81C424C();
void sub_81C0C68(u8 taskId);
void sub_81C0D44(u8 taskId);
void sub_81C22CC(struct Pokemon* mon);
void sub_81C0F44(u8 taskId);
void sub_81C3E9C(u16 a);
void sub_81C3F44();
void sub_81C44F0();
void sub_81C4AF8(u8 a);
void sub_81C1070(s16* a, s8 b, u8* c);
void sub_81C11F4(u8 a);
void sub_81C129C(u8 a);
bool8 sub_81C1040();
void sub_81C4064();
void sub_81C4C60(u8 a);
void sub_81C12E4(u8 taskId);
void sub_81C4C84(u8 a);
void sub_81C13B0(u8 a, u8 b);
void sub_81C14BC(struct Pokemon *mon, u8 a, u8 b);
void sub_81C15EC(struct BoxPokemon *mon, u8 a, u8 b);
void sub_81C40A0(u8 a, u8 b);
void sub_81C4568(u8 a, u8 b);
void sub_81C174C(u8 taskId);
bool8 sub_81C18A8();
void sub_81C18F4(u8 a);
u8 sub_81B6D14(u16 a);
void sub_81C1940(u8 taskId);
void sub_81C4154();
void sub_81C1F80(u8 taskId);
void sub_81C2628();
void sub_81C2794();
void sub_81C27DC(struct Pokemon *mon, u16 a);
void sub_81C2D68(u8 a);
void sub_81C335C();
void sub_81C33CC();
void sub_81C3428();
void sub_81C349C();
void sub_81C2EC4();
void sub_81C2F5C();
void sub_81C2FD8();
void sub_81C302C();
void sub_81C307C();
void sub_81C3194();
void sub_81C31C0();
bool8 sub_81C3304();
void sub_81C31F0(u8 *a);
u8 sub_81C3220();
bool8 sub_81C32BC();
void sub_81C35E4();
void sub_81C3690();
void sub_81C3710();
void sub_81C37D8();
void sub_81C3808();
void sub_81C3890();
void sub_81C38C0();
void sub_81C3B08(u8 a);
void sub_81C3E2C(u8 a);
void sub_81C4D18();

void SetBgAttribute(u8 bg, u8 attributeId, u8 value);

bool8 sub_81BFB10();
u8 sub_81B1250();

union UnkUnion
{
    struct Pokemon mon[6];
    struct BoxPokemon boxMon[6];
};


u8 sub_80D214C(union UnkUnion* a, u8 b, u8 c, u8 d);

struct PokeSummary
{
    u16 species; // 0x0
    u16 species2; // 0x2
    u8 isEgg; // 0x4
    u8 level; // 0x5
    u8 ribbons; // 0x6
    u8 unk7; // 0x7
    u8 altAbility; // 0x8
    u8 metLocation; // 0x9
    u8 metLevel; // 0xA
    u8 metGame; // 0xB
    u32 pid; // 0xC
    u32 exp; // 0x10
    u16 moves[4]; // 0x14
    u8 pp[4]; // 0x1C
    u16 currentHP; // 0x20
    u16 maxHP; // 0x22
    u16 atk; // 0x24
    u16 def; // 0x26
    u16 spatk; // 0x28
    u16 spdef; // 0x2A
    u16 speed; // 0x2C
    u16 item; // 0x2E
    u16 friendship; // 0x30
    u8 OTGender; // 0x32
    u8 nature; // 0x33
    u8 ppBonuses; // 0x34
    u8 sanity; // 0x35
    u8 OTName[8]; // 0x36
    u8 unk3E[9]; // 0x3E
    u32 OTID; // 0x48
};

struct UnkSummaryStruct
{
    /*0x00*/ union UnkUnion *unk0;
    /*0x04*/ void *unk4;
    /*0x08*/ void *unk8;
    /*0x0C*/ struct Pokemon currentMon;
    /*0x70*/ struct PokeSummary summary;
    u16 unkTilemap0[0x400];
    u16 unkTilemap0_1[0x400];
    u16 unkTilemap1[0x400];
    u16 unkTilemap1_1[0x400];
    u16 unkTilemap2[0x400];
    u16 unkTilemap2_1[0x400];
    u16 unkTilemap3[0x400];
    u16 unkTilemap3_1[0x400];
    u8 unk40BC;
    u8 unk40BD;
    u8 unk40BE;
    u8 unk40BF;
    u8 unk40C0;
    u8 unk40C1;
    u8 unk40C2;
    u8 unk40C3;
    u16 unk40C4;
    u8 unk40C6;
    u8 unk40C7;
    u8 unk40C8;
    u8 unk40C9;
    u8 unk40CA;
    u8 unk40CB[8];
    u8 unk40D3;
    u8 unk40D4;
    u8 unk40D5;
    u8 unk_filler5[0x19];
    u8 unk40EF;
    s16 unk40F0;
    u8 unk_filler4[6];
};

void sub_81BF8EC(u8 a, void *b, u8 c, u8 d, void *e)
{
    u8 byte;
    gUnknown_0203CF1C = AllocZeroed(sizeof(struct UnkSummaryStruct));
    gUnknown_0203CF1C->unk40BC = a;
    gUnknown_0203CF1C->unk0 = b;
    gUnknown_0203CF1C->unk40BE = c;
    gUnknown_0203CF1C->unk40BF = d;
    gUnknown_0203CF1C->unk4 = e;
    if (a == 2)
