#include "global.h"
#include "constants/songs.h"
#include "overworld.h"
#include "field_effect.h"
#include "random.h"
#include "sound.h"
#include "main.h"
#include "slot_machine.h"
#include "string_util.h"
#include "decompress.h"
#include "trig.h"
#include "graphics.h"
#include "palette.h"
#include "util.h"
#include "text.h"
#include "menu.h"
#include "alloc.h"
#include "bg.h"
#include "gpu_regs.h"
#include "coins.h"
#include "tv.h"
#include "text_window.h"
#include "constants/rgb.h"
#include "main_menu.h"
#include "bg.h"
#include "window.h"

// Text
extern const u8 gText_YouDontHaveThreeCoins[];
extern const u8 gText_QuitTheGame[];
extern const u8 gText_YouveGot9999Coins[];
extern const u8 gText_YouveRunOutOfCoins[];
extern const u8 gText_ReelTimeHelp[];

enum
{
    SLOT_MACHINE_TAG_7_RED,
    SLOT_MACHINE_TAG_7_BLUE,
    SLOT_MACHINE_TAG_AZURILL,
    SLOT_MACHINE_TAG_LOTAD,
    SLOT_MACHINE_TAG_CHERRY,
    SLOT_MACHINE_TAG_POWER,
    SLOT_MACHINE_TAG_REPLAY
};

enum
{
    SLOT_MACHINE_MATCHED_1CHERRY,
    SLOT_MACHINE_MATCHED_2CHERRY,
    SLOT_MACHINE_MATCHED_REPLAY,
    SLOT_MACHINE_MATCHED_LOTAD,
    SLOT_MACHINE_MATCHED_AZURILL,
    SLOT_MACHINE_MATCHED_POWER,
    SLOT_MACHINE_MATCHED_777_MIXED,
    SLOT_MACHINE_MATCHED_777_RED,
    SLOT_MACHINE_MATCHED_777_BLUE,
    SLOT_MACHINE_MATCHED_NONE
};

struct SlotMachineEwramStruct
{
    /*0x00*/ u8 slotActionPtr;
    /*0x01*/ u8 machineId;
    /*0x02*/ u8 pikaPower;
    /*0x03*/ u8 luckyGame;
    /*0x04*/ u8 luckyFlags;
    /*0x05*/ u8 reelTimeDraw;
    /*0x06*/ u8 isBiasTagMatchPossible;  // tentative
    /*0x07*/ u8 biasTag;
    /*0x08*/ u16 matchedSymbols;
    /*0x0A*/ u8 fairRollsLeft;
    /*0x0B*/ u8 fairRollsUsed;
    /*0x0C*/ s16 coins;
    /*0x0E*/ s16 payout;
    /*0x10*/ s16 netCoinLoss; // coins lost to machine (but never goes below 0)
    /*0x12*/ s16 bet;
    /*0x14*/ s16 reelTimePixelOffset;
    /*0x16*/ s16 reelTimePosition;
    /*0x18*/ s16 currReel;
    /*0x1A*/ s16 reelIncrement;
    /*0x1C*/ s16 reelPixelOffsets[3];
    /*0x22*/ u16 stopReelPixelOffset[3];
    /*0x28*/ s16 reelPositions[3];
    /*0x2E*/ s16 reelExtraTurns[3];
    /*0x34*/ s16 biasTagFinalPositions[3];  
    /*0x3A*/ u8 reelTasks[3];
    /*0x3D*/ u8 unkTaskPointer3D;
    /*0x3E*/ u8 unkTaskPointer;
    /*0x3F*/ u8 reelTimeSprite3F;
    /*0x40*/ u8 unk40;
    /*0x41*/ u8 unk41;
    /*0x42*/ u8 unk42;
    /*0x43*/ u8 unk43;
    /*0x44*/ u8 unk44[5];
    /*0x49*/ u8 unk49[2];
    /*0x49*/ u8 unk4B[3];
    /*0x4E*/ u8 unk4E[2];
    /*0x50*/ u8 reelTimeSprites1[2];
    /*0x52*/ u8 reelTimeSprites2[2];
    /*0x54*/ u8 unk54[4];
    /*0x58*/ u16 win0h;
    /*0x5a*/ u16 win0v;
    /*0x5c*/ u16 winIn;
    /*0x5e*/ u16 winOut;
    /*0x60*/ u16 backupMapMusic;
    /*0x64*/ MainCallback prevMainCb;
};

struct UnkStruct1
{
    /*0x00*/ u8 unk00;
    /*0x01*/ u8 unk01;
    /*0x02*/ s16 unk02;
};

#define SLOTMACHINE_GFX_TILES 233

/*static */void CB2_SlotMachineSetup(void);
/*static */void CB2_SlotMachineLoop(void);
/*static */void PlaySlotMachine_Internal(u8 slotMachineIndex, MainCallback CB2_ReturnToFieldContinueScriptPlayMapMusic);
/*static */void SlotMachineDummyTask(u8 taskId);
/*static */void SlotMachineSetup_0_0(void);
/*static */void SlotMachineSetup_6_2(void);
/*static */void SlotMachineSetup_1_0(void);
/*static */void SlotMachineSetup_2_0(void);
/*static */void SlotMachineSetup_2_1(void);
/*static */void SlotMachineSetup_0_1(void);
/*static */void SlotMachineSetup_3_0(void);
/*static */void SlotMachineSetup_4_0(void);
/*static */void SlotMachineSetup_5_0(void);
/*static */void SlotMachineSetup_6_0(void);
/*static */void SlotMachineSetup_6_1(void);
/*static */void SlotMachineSetup_8_0(void);
/*static */void SlotMachineSetup_9_0(void);
/*static */void SlotMachineSetup_10_0(void);
/*static */void SlotMachineSetupGameplayTasks(void);
