#include "global.h"
#include "main.h"
#include "pokeblock.h"
#include "malloc.h"
#include "decompress.h"
#include "graphics.h"
#include "palette.h"
#include "pokenav.h"
#include "menu_specialized.h"
#include "scanline_effect.h"
#include "text.h"
#include "bg.h"
#include "window.h"
#include "text_window.h"
#include "constants/rgb.h"
#include "sound.h"
#include "constants/songs.h"
#include "sprite.h"
#include "string_util.h"
#include "strings.h"
#include "menu.h"
#include "gpu_regs.h"
#include "graphics.h"
#include "pokemon_summary_screen.h"
#include "item_menu.h"

/*
    This file handles the pokeblock screen where the player
    chooses which pokemon to give a pokeblock to. The subsequent
    scene of feeding the pokeblock to the pokemon is handled by
    pokeblock_feed.c, and the rest of the pokeblock menu (and 
    other pokeblock-related functions) are in pokeblock.c
*/

enum {
    WIN_NAME,
    WIN_NATURE,
    WIN_TEXT,
    WIN_COUNT
};

struct UsePokeblockSession
{
    /*0x00*/ void (*callback)(void);
    /*0x04*/ void (*exitCallback)(void);
    /*0x08*/ struct Pokeblock *pokeblock;
    /*0x0C*/ struct Pokemon *mon;
    /*0x10*/ u8 stringBuffer[0x40];
    /*0x50*/ u8 mainState;
    /*0x51*/ u8 field_51; // unused
    /*0x52*/ u8 field_52;
    /*0x53*/ u8 field_53;
    /*0x54*/ u8 numEnhancements;
    /*0x55*/ u8 field_55; // unused
    /*0x56*/ u8 field_56;
    /*0x57*/ u8 field_57[FLAVOR_COUNT];
    /*0x5C*/ u8 field_5c[FLAVOR_COUNT];
    /*0x61*/ u8 field_61[FLAVOR_COUNT];
    /*0x66*/ s16 field_66[FLAVOR_COUNT];
    /*0x70*/ u8 field_70; // mon id + 1
    /*0x71*/ u8 field_71; // mon id 
    /*0x74*/ u8 (*unk74)(void); // selection handler
    /*0x78*/ u8 helperState;
    /*0x79*/ u8 filler79[1]; // unused
    /*0x7A*/ u8 field_7A[0x22]; // nature text buffer
};

// This struct is identical to PokenavMonList, the struct used for managing lists of pokemon in the pokenav
// Given that this screen is essentially duplicated in the poknav, this struct was probably the same one with
// a more general name/purpose
// TODO: Once the pokenav conditions screens are documented, resolve the above
struct UsePokeblockMenuPokemon
{
    u8 boxId; // Because this screen is never used for the PC this is always set to TOTAL_BOXES_COUNT to refer to party
    u8 monId;
    u16 data; // never read
};

struct UsePokeblockMenu
{
    /*0x0000*/ u8 filler0[4]; // unused
    /*0x0000*/ u16 field_4[6][0x40]; // pal buffer
    /*0x0304*/ u8 field_304[3][0x2000]; // sheet buffer
    /*0x6304*/ u8 filler_6304[0x1000]; // unused?
    /*0x7304*/ u8 tilemapBuffer[BG_SCREEN_SIZE + 2];
    /*0x7B06*/ u8 field_7B06[7]; // sprite ids
    /*0x7B0E*/ s16 field_7B0E; // x pos?
    /*0x7B10*/ u8 field_7B10; // sprite id?
    /*0x7B12*/ u16 field_7B12; // pal
    /*0x7B12*/ u16 field_7B14; // sheet
    /*0x7B12*/ u8 *field_7B18;
    /*0x7B1C*/ struct Sprite *sparkles[10];
    /*0x7B44*/ struct Sprite *condition[2];
    /*0x7B4C*/ u8 field_7B4C;
    /*0x7B4D*/ u8 field_7B4D[3][24];
    /*0x7B95*/ u8 field_7B95[3][64];
    /*0x7C58*/ struct UnknownStruct_81D1ED4 field_7C58;
    /*0x7FB0*/ u8 unk7FB0[3];
    /*0x7FB3*/ s8 field_7FB3;
    /*0x7FB4*/ s8 field_7FB4;
    /*0x7FB5*/ s8 field_7FB5;
    /*0x7FB6*/ s8 field_7FB6;
    /*0x7FB8*/ struct UsePokeblockMenuPokemon party[PARTY_SIZE];
    /*0x7FD0*/ struct UsePokeblockSession info;
};

#define TAG_UP_DOWN     0
#define TAG_CONDITION   1

static void SetUsePokeblockCallback(void (*func)(void));
static void LoadUsePokeblockMenu(void);
static void sub_816631C(void);
static void sub_81662C0(void);
static void ShowUsePokeblockMenu(void);
static void sub_8166304(void);
static void sub_81668F8(void);
static void sub_8167420(void);
static void sub_8167760(void);
static u8 GetNumNonEggPartyMons(u8);
static bool8 sub_8168328(void);
static bool8 LoadUsePokeblockGfx(void);
static void sub_8167608(u8);
static void UpdateMonInfoText(u16, bool8);
static void UsePokeblockMenu(void);
static void sub_8167CA0(bool8);
static void CloseUsePokeblockMenu(void);
static void AskUsePokeblock(void);
static s8 HandleAskUsePokeblockInput(void);
static bool8 IsSheenMaxed(void);
static void PrintWontEatAnymore(void);
static void FeedPokeblockToMon(void);
static void EraseMenuWindow(void);
static u8 sub_81672A4(u8);
static void sub_8166A34(void);
