#include "global.h"
#include "main.h"
#include "pokeblock.h"
#include "malloc.h"
#include "decompress.h"
#include "graphics.h"
#include "palette.h"
#include "pokenav.h"
#include "menu_specialized.h"
#include "scanline_effect.h"
#include "text.h"
#include "bg.h"
#include "window.h"
#include "text_window.h"
#include "constants/rgb.h"
#include "sound.h"
#include "constants/songs.h"
#include "sprite.h"
#include "string_util.h"
#include "strings.h"
#include "menu.h"
#include "gpu_regs.h"
#include "graphics.h"
#include "pokemon_summary_screen.h"
#include "item_menu.h"

struct UsePokeblockSubStruct
{
    /*0x00*/ void (*field_0)(void);
    /*0x04*/ void (*callback)(void);
    /*0x08*/ struct Pokeblock *pokeblock;
    /*0x0C*/ struct Pokemon *mon;
    /*0x10*/ u8 stringBuffer[0x40];
    /*0x50*/ u8 field_50;
    /*0x51*/ u8 field_51;
    /*0x52*/ u8 field_52;
    /*0x53*/ u8 field_53;
    /*0x54*/ u8 field_54;
    /*0x55*/ u8 field_55;
    /*0x56*/ u8 field_56;
    /*0x57*/ u8 field_57[5];
    /*0x5C*/ u8 field_5c[5];
    /*0x61*/ u8 field_61[5];
    /*0x66*/ s16 field_66[5];
    /*0x70*/ u8 field_70;
    /*0x71*/ u8 field_71;
    /*0x74*/ u8 (*unk74)(void);
    /*0x78*/ u8 unk78;
    /*0x79*/ u8 filler79[0x1];
    /*0x7A*/ u8 field_7A[0x22];
};

struct Unk7FB8
{
    u8 unk0;
    u8 unk1;
    u16 unk2;
};

struct UsePokeblockStruct
{
    /*0x0000*/ u8 filler0[4];
    /*0x0000*/ u16 field_4[6][0x40];
    /*0x0304*/ u8 field_304[3][0x2000];
    /*0x6304*/ u8 filler_6304[0x1000];
    /*0x7304*/ u8 tilemapBuffer[BG_SCREEN_SIZE + 2];
    /*0x7B06*/ u8 field_7B06[7];
    /*0x7B0E*/ s16 field_7B0E;
    /*0x7B10*/ u8 field_7B10;
    /*0x7B12*/ u16 field_7B12;
    /*0x7B12*/ u16 field_7B14;
    /*0x7B12*/ u8 *field_7B18;
    /*0x7B1C*/ struct Sprite *field_7B1C[10];
    /*0x7B44*/ struct Sprite *field_7B44[2];
    /*0x7B4C*/ u8 field_7B4C;
    /*0x7B4D*/ u8 field_7B4D[3][24];
    /*0x7B95*/ u8 field_7B95[3][64];
    /*0x7C58*/ struct UnknownStruct_81D1ED4 field_7C58;
    /*0x7FB0*/ u8 unk7FB0[3];
    /*0x7FB3*/ s8 field_7FB3;
    /*0x7FB4*/ s8 field_7FB4;
    /*0x7FB5*/ s8 field_7FB5;
    /*0x7FB6*/ s8 field_7FB6;
    /*0x7FB8*/ struct Unk7FB8 field_7FB8[6];
    /*0x7FD0*/ struct UsePokeblockSubStruct info;
};

#define TAG_TILE_CONDITION_UP_DOWN    0
#define TAG_PAL_CONDITION_UP_DOWN     0
#define TAG_PAL_POKEBLOCK_CONDITION   1

extern void sub_81D21DC(u8);

// this file's functions
void sub_816636C(void (*func)(void));
void sub_8166380(void);
void sub_816631C(void);
void sub_81662C0(void);
void sub_8166564(void);
void sub_8166304(void);
void sub_81668F8(void);
void sub_8167420(void);
void sub_8167760(void);
u8 sub_81672E4(u8 arg0);
static bool8 sub_8168328(void);
bool8 sub_8167930(void);
void sub_8167608(u8 arg0);
void sub_8167BA0(u16 arg0, u8 copyToVramMode);
void sub_8166634(void);
static void sub_8167CA0(bool8);
void sub_8166BEC(void);
void sub_8166D44(void);
s8 sub_8166DE4(void);
bool8 IsSheenMaxed(void);
void sub_8166F50(void);
void sub_816681C(void);
void sub_8166F94(void);
u8 sub_81672A4(u8 a0);
void sub_8166A34(void);
void sub_8167104(void);
void sub_8167338(void);
void sub_81681F4(u8);
void sub_8166E24(void);
