#include "global.h"
#include "pokemon.h"
#include "strings.h"
#include "random.h"
#include "text.h"
#include "event_data.h"
#include "region_map.h"
#include "constants/species.h"
#include "constants/items.h"
#include "constants/abilities.h"
#include "data/text/wonder_trade_OT_names.h"
#include "constants/region_map_sections.h"
#include "item.h"
#include "constants/item.h"
#include "constants/hold_effects.h"
#include "mail.h"
#include "constants/pokemon.h"
#ifdef POKEMON_EXPANSION
#include "party_menu.h"
#include "field_weather.h"
#include "constants/weather.h"
#endif

extern struct Evolution gEvolutionTable[][EVOS_PER_MON];

struct InGameTrade {
    /*0x00*/ u8 name[11];
    /*0x0C*/ u16 species;
    /*0x0E*/ u8 ivs[6];
    /*0x14*/ bool8 ability;
    /*0x18*/ u32 otId;
    /*0x1C*/ u8 stats[5];
    /*0x24*/ u32 personality;
    /*0x28*/ u16 heldItem;
    /*0x2A*/ u8 mailNum;
    /*0x2B*/ u8 otName[11];
    /*0x36*/ u8 otGender;
    /*0x37*/ u8 sheen;
    /*0x38*/ u16 playerSpecies;
};

#ifndef POKEMON_EXPANSION
// This is a list of items that were not used in vanilla.
// Feel free to delete it and remove the check that uses it.
static const u16 sInvalidItem[] = {
    [ITEM_034] = 1,
    [ITEM_035] = 1,
    [ITEM_036] = 1,
    [ITEM_037] = 1,
    [ITEM_038] = 1,
    [ITEM_039] = 1,
    [ITEM_03A] = 1,
    [ITEM_03B] = 1,
    [ITEM_03C] = 1,
    [ITEM_03D] = 1,
    [ITEM_03E] = 1,
    [ITEM_048] = 1,
    [ITEM_052] = 1,
    [ITEM_057] = 1,
    [ITEM_058] = 1,
    [ITEM_059] = 1,
    [ITEM_05A] = 1,
    [ITEM_05B] = 1,
    [ITEM_05C] = 1,
    [ITEM_063] = 1,
    [ITEM_064] = 1,
    [ITEM_065] = 1,
    [ITEM_066] = 1,
    [ITEM_069] = 1,
    [ITEM_070] = 1,
    [ITEM_071] = 1,
    [ITEM_072] = 1,
    [ITEM_073] = 1,
    [ITEM_074] = 1,
    [ITEM_075] = 1,
    [ITEM_076] = 1,
    [ITEM_077] = 1,
    [ITEM_078] = 1,
    [ITEM_UNUSED_BERRY_1] = 1,
    [ITEM_UNUSED_BERRY_2] = 1,
    [ITEM_UNUSED_BERRY_3] = 1,
    [ITEM_0E2] = 1,
